OdGeExtents3d.op_Inequality(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeExtents3d object.
\param extents [in]  Other extents to compare.
\returns
A boolean value that indicates whether the input OdGeExtents3d object is not identical to these extents object.

OdGeExtents3d.op_Equality(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeExtents3d object.
\param extents [in]  Other extents to compare.
\returns
A boolean value that indicates whether the input OdGeExtents3d object is identical to these extents object.

OdGeExtents3d.isEqualTo(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks if this OdGeExtents3d object is equal to the passed extents.
\param extents [in]  3D extents to be compared for equality.
\param tol [in]  Geometric tolerance.
\remarks
This method compares this object to the passed object by testing the equivalence of their definition points.
\returns
true if the points match within the range specified by tolerance. Otherwise, it returns false.

OdGeExtents3d.setFrom2d(OdGeExtents2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d.Convert2dPlane)
\details
Sets minimum and maximum points for this OdGeExtents3d object from a passed OdGeExtents2d object.
\param extents [in]  2D extents from which conversion is calculated.
\param plane [in]  Plane on which the OdGeExtents2d object lies.
\remarks
This method sets 0 to the coordinate on the axis that is absent in the passed OdGeExtents2d object.

OdGeExtents3d.convert2d(OdGeExtents2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d.Convert2dPlane)
\details
Converts this OdGeExtents3d object to a OdGeExtents2d object.
\param extents [out]  Resulting converted 2D extents object.
\param plane [in]  Plane according to which conversion is calculated.
\remarks
This method sets minimum and maximum 2D points of this OdGeExtents3d object, eliminating one of the axes.

OdGeExtents3d.diagonal
\details
Returns the vector from minimum to maximum point.
\returns
Vector from minimal to maximal point.

OdGeExtents3d.center
\details
Returns a center point of this OdGeExtents3d object.
\returns
Center point as OdGePoint3d.

OdGeExtents3d.isWithinRange(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Checks whether the box intersects the sphere with specified center and radius.
\param pt [in]  A 3D point that represents the sphere center.
\param radius [in]  A radius of the sphere.
\returns
true if and only if the box intersects the sphere with specified center and radius.

OdGeExtents3d.intersectWith(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d*)
\details
Determines the intersection of the specified OdGeExtents3d object with this one,
and returns the resulting intersection box.
\param extents [in]  Any 3D Extents object.
\param pResult [out]  Receives extents of the intersection.
\remarks
pResult object should be created by the caller.
\returns
Possible return values are as follows:
@untitled table
kIntersectUnknown   Either or both extents boxes are invalid
kIntersectNot       The extents boxes are not intersecting
kIntersectOpIn      The specified Extents object is completely within this one
kIntersectOpOut     This OdGeExtents3d object is completely within the specified one
kIntersectOk        The extents boxes are intersecting, and a result is returned

OdGeExtents3d.distanceTo(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Calculates distance to the specified extents.
\param iExtents [in]  GeExtents3d to find distance to.
\returns
0.0 if extents intersect or euclidean distance otherwise.

OdGeExtents3d.distanceTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Calculates distance to the specified point.
\param iPoint [in]  Point to find distance to.
\returns
0.0 if point is inside the box or euclidean distance otherwise.

OdGeExtents3d.isDisjointEuclidean(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified extents do not intersect these extents.
\param extents [in]  Any 3D Extents object.
\param tol     [in]  Geometric tolerance.
\returns
true if and only if specified OdGeExtents3d object does not intersect this one.
\remarks
This method is the same as isDisjoint, but checks precisely whether minimal Euclidean distance is greater than tolerance.

OdGeExtents3d.isDisjoint(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified extents do not intersect these extents.
\param extents [in]  Any 3D Extents object.
\param tol     [in]  Geometric tolerance.
\returns
true if and only if specified OdGeExtents3d object does not intersect this one.

OdGeExtents3d.contains(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether if this OdGeExtents3d object contains the specified extents.
\param extents [in]  3D extents that are tested to be within these extents.
\param tol [in]  Geometric tolerance.
\returns
true if and only if this OdGeExtents3d object contains valid extents.

OdGeExtents3d.contains(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether this OdGeExtents3d object contains the specified point.
\param point [in]  A 3D point that is presumably contained inside these extents.
\param tol [in]  Geometric tolerance.
\returns
true if and only if this OdGeExtents3d object contains valid extents.

OdGeExtents3d.transformBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Applies the 3D transformation matrix to the extents.
\param xfm [in]  3D transformation matrix.

OdGeExtents3d.expandBy(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this OdGeExtents3d object by the specified vector.
\param vect [in]  A 3D vector that defines where new points are located.

OdGeExtents3d.isValidExtents
\details
Checks whether this OdGeExtents3d object contains valid extents.
\remarks
Extents are valid if and only if each member of the minimum extents
is less than or equal to the corresponding member of maximum extents.
\returns
true if and only if this OdGeExtents3d object contains valid extents.

OdGeExtents3d.addExt(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this OdGeExtents3d object with the specified array of points.
\param extents [in]  Array of 3D points that are added to these extents.
\returns
Reference to this OdGeExtents3d object.

OdGeExtents3d.addPoints(OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this OdGeExtents3d object with the specified point.
\param points [in]  Array of 3D points that are added to extents.
\returns
Reference to this OdGeExtents3d object.

OdGeExtents3d.addPoint(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this OdGeExtents3d object with the specified point.
\param point [in]  Any 3D point.

OdGeExtents3d.comparingSet(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the minimum and maximum points for this OdGeExtents3d object to
that of the box defined by pt1 and pt2.
\param pt1 [in]  First point that defines the extents.
\param pt2 [in]  Second point that defines the extents.
\remarks
The passed first and second points are only needed to define a box. The points
themselves do not necessarily need to be minimum and maximum points. The
coordinates of the passed points are compared and then set to real minimum and maximum points.

OdGeExtents3d.set(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the minimum and maximum points for this OdGeExtents3d object.
\param min [in]  Minimum point.
\param max [in]  Maximum point.

OdGeExtents3d.op_Subscript(System.Int32)
\details
Returns the vertex of the box depending on index.
\param iIndex [in]  Index of the vertex to return.
\returns
Minimum vertex when iIndex = 0, maximum vertex otherwise.
\details
Returns the reference to the vertex of the box depending on index.
\param iIndex [in]  Index of the vertex to return.
\returns
Reference to the minimum vertex when iIndex = 0, reference to the maximum vertex otherwise.

OdGeExtents3d.maxPoint
\details
Returns the maximum point of this OdGeExtents3d object.
\returns
Reference to maximum point of these extents.

OdGeExtents3d.minPoint
\details
Returns the minimum point of this OdGeExtents3d object.
\returns
Reference to minimum point of these extents.

OdGeExtents3d.kInvalid
\details
The invalid extents.

OdGeExtents3d.#ctor(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGeExtents3d class.
\param min [in]  Minimum point.
\param max [in]  Maximum point.

OdGeExtents3d.#ctor
\details
Default constructor for the OdGeExtents3d class.